; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-92)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 - object)
 (:init 
    (arm-empty)
    (clear b23)
    (on b23 b2)
    (on b2 b11)
    (on b11 b9)
    (on-table b9)
    (clear b12)
    (on b12 b19)
    (on b19 b16)
    (on b16 b7)
    (on b7 b1)
    (on b1 b27)
    (on-table b27)
    (clear b17)
    (on b17 b20)
    (on b20 b15)
    (on b15 b13)
    (on b13 b5)
    (on b5 b26)
    (on b26 b8)
    (on b8 b21)
    (on b21 b3)
    (on b3 b4)
    (on b4 b14)
    (on b14 b25)
    (on-table b25)
    (clear b22)
    (on b22 b18)
    (on b18 b24)
    (on b24 b6)
    (on b6 b10)
    (on-table b10))
 (:goal (and 
(on-table b12)
(on-table b17)
(on-table b6)
(on b8 b17)
(on b11 b6)
(on b13 b12)
(on b18 b8)
(on b19 b18)
))
)

; plan
1. (unstack b12 b19)
   deleted: (on b12 b19) (clear b12) (arm-empty)
   added: (holding b12) (clear b19)
   goals met: 0 of 8
2. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 8
3. (unstack b17 b20)
   deleted: (on b17 b20) (clear b17) (arm-empty)
   added: (holding b17) (clear b20)
   goals met: 1 of 8
4. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 8
5. (unstack b20 b15)
   deleted: (on b20 b15) (clear b20) (arm-empty)
   added: (holding b20) (clear b15)
   goals met: 2 of 8
6. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 8
7. (unstack b15 b13)
   deleted: (on b15 b13) (clear b15) (arm-empty)
   added: (holding b15) (clear b13)
   goals met: 2 of 8
8. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 2 of 8
9. (unstack b13 b5)
   deleted: (on b13 b5) (clear b13) (arm-empty)
   added: (holding b13) (clear b5)
   goals met: 2 of 8
10. (stack b13 b12)
   deleted: (clear b12) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b12)
   goals met: 3 of 8
11. (unstack b5 b26)
   deleted: (on b5 b26) (clear b5) (arm-empty)
   added: (holding b5) (clear b26)
   goals met: 3 of 8
12. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 3 of 8
13. (unstack b26 b8)
   deleted: (on b26 b8) (clear b26) (arm-empty)
   added: (holding b26) (clear b8)
   goals met: 3 of 8
14. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 3 of 8
15. (unstack b8 b21)
   deleted: (on b8 b21) (clear b8) (arm-empty)
   added: (holding b8) (clear b21)
   goals met: 3 of 8
16. (stack b8 b17)
   deleted: (clear b17) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b17)
   goals met: 4 of 8
17. (unstack b22 b18)
   deleted: (on b22 b18) (clear b22) (arm-empty)
   added: (holding b22) (clear b18)
   goals met: 4 of 8
18. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 4 of 8
19. (unstack b18 b24)
   deleted: (on b18 b24) (clear b18) (arm-empty)
   added: (holding b18) (clear b24)
   goals met: 4 of 8
20. (stack b18 b8)
   deleted: (clear b8) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b8)
   goals met: 5 of 8
21. (unstack b19 b16)
   deleted: (on b19 b16) (clear b19) (arm-empty)
   added: (holding b19) (clear b16)
   goals met: 5 of 8
22. (stack b19 b18)
   deleted: (clear b18) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b18)
   goals met: 6 of 8
23. (unstack b24 b6)
   deleted: (on b24 b6) (clear b24) (arm-empty)
   added: (holding b24) (clear b6)
   goals met: 6 of 8
24. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 6 of 8
25. (unstack b6 b10)
   deleted: (on b6 b10) (clear b6) (arm-empty)
   added: (holding b6) (clear b10)
   goals met: 6 of 8
26. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 7 of 8
27. (unstack b23 b2)
   deleted: (on b23 b2) (clear b23) (arm-empty)
   added: (holding b23) (clear b2)
   goals met: 7 of 8
28. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 7 of 8
29. (unstack b2 b11)
   deleted: (on b2 b11) (clear b2) (arm-empty)
   added: (holding b2) (clear b11)
   goals met: 7 of 8
30. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 8
31. (unstack b11 b9)
   deleted: (on b11 b9) (clear b11) (arm-empty)
   added: (holding b11) (clear b9)
   goals met: 7 of 8
32. (stack b11 b6)
   deleted: (clear b6) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b6)
   goals met: 8 of 8
